INSERT INTO Depo (Name, Parking_spaces, Repair_spaces, Address, Contact_phone) VALUES
('Трамвайное депо №1', 150, 20, 'ул. Ленина, д. 10', '+7 (999) 111-22-33'),
('Трамвайное депо №2', 200, 35, 'пр. Мира, д. 45', '+7 (999) 444-55-66'),
('Трамвайное депо №3', 100, 10, 'ул. Победы, д. 5', '+7 (999) 777-88-99');

INSERT INTO Tracks (Depo_number, Track_number, Purpose, Track_length, Is_track_free, Is_electrified) VALUES
(1, 1, 'Для стоянки пассажирских трамваев', 25.5, TRUE, TRUE),
(1, 2, 'Для стоянки пассажирских трамваев', 25.5, FALSE, TRUE),
(1, 3, 'Ремонтный путь', 15.0, TRUE, FALSE),
(1, 4, 'Отстойник', 40.0, TRUE, TRUE),
(2, 1, 'Для стоянки пассажирских трамваев', 30.0, TRUE, TRUE),
(2, 2, 'Для стоянки пассажирских трамваев', 30.0, TRUE, TRUE),
(2, 3, 'Ремонтный путь', 20.0, FALSE, FALSE),
(2, 4, 'Выездной путь', 50.0, FALSE, TRUE),
(3, 1, 'Для стоянки пассажирских трамваев', 22.0, TRUE, TRUE),
(3, 2, 'Отстойник', 35.0, TRUE, FALSE);